In [1]:
import duckdb
import pandas as pd

In [44]:
sql_query = '''
SELECT * FROM employee
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    display(con.sql(sql_query).df())

   id emp_name  age
0   1      Tom   34
1   2      Sam   35
2   3     Alex   30
3   4     John   40
4   5     Nick   31

In [43]:
sql_query = '''
SELECT * FROM bronze_employee
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    display(con.sql(sql_query).df())

   id emp_name  age
0   1      Tom   34
1   2      Sam   35
2   3     Alex   30
3   4    Smith   40

In [45]:
sql_query = '''
SELECT * FROM bronze_employee
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    display(con.sql(sql_query).df())

   id emp_name  age
0   1      Tom   34
1   2      Sam   35
2   3     Alex   30
3   4     John   40
4   5     Nick   31

In [ ]:
# sql_query_import_1 = '''
# CREATE OR REPLACE TABLE nyc_parking_violation_codes AS
# SELECT *
# FROM read_csv_auto(
#     "data/dof_parking_violation_codes.csv",
#     normalize_names=True
#     )
# '''

# sql_query_import_2 = '''
# CREATE OR REPLACE TABLE parking_violation_2023 AS
# SELECT *
# FROM read_csv_auto(
#     "data/parking_violations_issued_fiscal_year_2023_sample.csv",
#     normalize_names=True
#     )
# '''

# with duckdb.connect("data/nyc_parking_violations.db") as con:
#     con.sql(sql_query_import_1)
#     con.sql(sql_query_import_2)

In [29]:
sql_query_import_3 = '''
CREATE OR REPLACE TABLE employee AS
SELECT *
FROM read_csv_auto(
    "data/employee.csv",
    normalize_names=True
    )
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    con.sql(sql_query_import_3)

In [39]:
sql_query = '''
INSERT INTO employee(id,emp_name,age) values (5,'Nick',31)
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    con.sql(sql_query)

In [41]:
# Change emp_id 4 name from Smith to John
sql_query = '''
UPDATE employee
SET emp_name = 'John'
WHERE id = 4
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    con.sql(sql_query)

# Production database operation below

In [24]:
sql_query_import_1 = '''
CREATE OR REPLACE TABLE nyc_parking_violation_codes AS
SELECT *
FROM read_csv_auto(
    "data/dof_parking_violation_codes.csv",
    normalize_names=True
    )
'''

sql_query_import_2 = '''
CREATE OR REPLACE TABLE parking_violation_2023 AS
SELECT *
FROM read_csv_auto(
    "data/parking_violations_issued_fiscal_year_2023_sample.csv",
    normalize_names=True
    )
'''

with duckdb.connect("data/prod_nyc_parking_violations.db") as con:
    con.sql(sql_query_import_1)
    con.sql(sql_query_import_2)

In [25]:
sql_query = '''
SHOW TABLES
'''

with duckdb.connect("data/prod_nyc_parking_violations.db") as con:
    display(con.sql(sql_query).df())

                             name
0        bronze_parking_violation
1  bronze_parking_violation_codes
2             gold_ticket_metrics
3           gold_vehicles_metrics
4     nyc_parking_violation_codes
5          parking_violation_2023
6        silver_violation_tickets
7       silver_violation_vehicles

In [46]:
sql_query_import_3 = '''
CREATE OR REPLACE TABLE employee AS
SELECT *
FROM read_csv_auto(
    "data/employee.csv",
    normalize_names=True
    )
'''

with duckdb.connect("data/prod_nyc_parking_violations.db") as con:
    con.sql(sql_query_import_3)

In [47]:
sql_query = '''
INSERT INTO employee(id,emp_name,age) values (5,'Nick',31)
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    con.sql(sql_query)

In [48]:
# Change emp_id 4 name from Smith to John
sql_query = '''
UPDATE employee
SET emp_name = 'John'
WHERE id = 4
'''

with duckdb.connect("data/nyc_parking_violations.db") as con:
    con.sql(sql_query)